<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=gb2312" />
<title>用户查询</title>
<style type="text/css">
<!--
.STYLE2 {
	font-size: x-large;
	font-weight: bold;
	color: #FF0000;
}
-->
</style>
</head>

<body>
<div align="center">
  <?php if ( empty( $_POST['btnSubmit'] ) ) { ?>
  <span class="STYLE2">直接操作增加经验值和等级</span></div>
<form id="form1" name="form1" method="post" action="">
  <table align="center" id="frmTable">
    <tr>
      <th colspan="2">填写角色名</th>
    </tr>
    <tr>
      <td>角色名：</td>
      <td><input name="Character_name" type="text" id="Character_name" /></td>
    </tr>
    <tr>
      <td>钱数：</td>
      <td><input name="Money" type="text" id="Money" /></td>
    </tr>
    <tr>
      <td valign="top">&nbsp;</td>
      <td>&nbsp;</td>
    </tr>
    <tr>
      <td>&nbsp;</td>
      <td><input name="btnSubmit" type="submit" id="btnSubmit" value="提交" />
      &nbsp;
      <input type="reset" name="Submit2" value="重置" /></td>
    </tr>
  </table>
</form>
<?php } else {
  if ( empty ( $_POST[Character_name] ) ) { 
    die ( "<p><b>用户名不能为空！</b></p>" );
  }
  if ( empty ( $_POST[Money])) {
    die ("<p><b>钱数不能为空！</b></p>");}
  	$strSql1="select character_no,wLevel,dwExp from character.dbo.user_character where character_name='$_POST[Character_name]'";
    $character_odbc = odbc_connect('account','DBUSER','DBPASS'); 
    $character_result=odbc_do($character_odbc,$strSql1);
    odbc_fetch_row($character_result);
	$character_no=odbc_result($character_result,1);
	$wLevel=odbc_result($character_result,2);
	$dwExp=odbc_result($character_result,3);
    odbc_close($character_odbc);
	if ( $character_no== null) { die ( "<p><b>无此玩家！</b></p>" );} 
    $allexp=$_POST[Money]*200000000;
    $explist=array(1=>50,
              100,
              210,
              450,
              880,
              1500,
              2340,
              3430,
              4800,
              6480,
              8500,
              10890,
              13680,
              16900,
              20580,
              24750,
              29440,
              34680,
              40500,
              46930,
              54000,
              61740,
              70180,
              79350,
              89280,
              100000,
              111540,
              123930,
              137200,
              151380,
              166500,
              182590,
              199680,
              217800,
              236980,
              257250,
              278640,
              301180,
              324900,
              349830,
              376000,
              403440,
              432180,
              462250,
              543048,
              658125,
              785036,
              924467,
              1077120,
              1243718,
              1425000,
              1621724,
              1834664,
              2064615,
              2312388,
              2578813,
              2864736,
              3171024,
              3498560,
              3848246,
              4221000,
              4617761,
              5039484,
              5487143,
              5961728,
              6464250,
              6995736,
              7557232,
              8149800,
              8774523,
              9432500,
              10124849,
              10852704,
              11617220,
              13306680,
              14990625,
              16779280,
              18676350,
              20685600,
              22810855,
              25056000,
              27424980,
              29921800,
              32550525,
              35315280,
              38220250,
              41269680,
              44467875,
              47819200,
              51328080,
              54999000,
              58836505,
              62845200,
              67029750,
              71394880,
              75945375,
              80686080,
              85621900,
              90757800,
              96098805,
              101650000,
              107416530,
              113403600,
              119616475,
              126060480,
              132741000,
              139663480,
              146833425,
              154256400,
              161938030,
              169884000,
              178100055,
              186592000,
              195365700,
              204427080,
              213782125,
              223436880,
              233397450,
              243670000,
              254260755,
              265176000,
              276422080,
              288005400,
              299932425,
              312209680,
              324843750,
              337841280,
              351208975,
              364953600,
              379081980,
              393601000,
              408517605,
              423838800,
              439571650,
              455723280,
              472300875,
              489311680,
              506763000,
              524662200,
              543016705,
              561834000,
              581121630,
              600887200,
              621138375,
              641882880,
              663128500,
              684883080,
              707154525,
              729950800,
              753279930,
              777150000,
              817600538,
              896801976,
              979900740,
              1067017228,
              1158274080,
              1253796195,
              1353710755,
              1458147240,
              1699641630,
              1881088000,
              2090269440,
              2328498900,
              2597119750,
              2903255100,
              3248623125,
              3634980850,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980,
              4005650980);
    $i=$wLevel;	
    $needexp=$explist[$i]-$dwExp;
    $exp1=$allexp-$needexp;
	if ($exp1>0) {
	$i=$i+1;	
	while ($exp1>$explist[$i]) {
	   $exp1=$exp1-$explist[$i];
	   $i=$i+1;
	   }
    }
	else {
	 $i=$wLevel;
	 $exp1=$allexp;
	 }
$uplevel=$i-$wLevel;
$level_query="update character.dbo.user_character set dwExp=dwExp+$exp1,wLevel=$i,wStatPoint=wStatPoint+$uplevel*5,wSkillPoint=wSkillPoint+$uplevel where character_no='$character_no'";
$dk_level_odbc = odbc_connect('account','account','DBPASS'); 
$dk_level_result=odbc_do($dk_level_odbc,$level_query);
odbc_close($dk_level_odbc);

?>
<table width="324" border="1" align="center" cellpadding="3" id="showTable">
  <tr>
    <th colspan="2">资料</th>
  </tr>
  <tr>
    <td width="110" height="24">用户名：</td>
    <td width="190"><?php echo $_POST['Character_name']; ?></td>
  </tr>
  <tr>
    <td>当前等级：</td>
    <td><?php echo $wLevel; ?></td>
  </tr>
    <tr>
    <td>当前等级的经验：</td>
    <td><?php echo $dwExp; ?></td>
  </tr>
    <tr>
    <td>可以升到的等级：</td>
    <td><?php echo $i; ?></td>
  </tr>
    <tr>
    <td>多出的经验值：</td>
    <td><?php echo $exp1; ?></td>
  </tr>
        <tr>    <td colspan="2"><div align="center">操作成功</div></td>
  </tr>
      <tr>
    <td colspan="2"><div align="center"><a href="index.html">返回菜单</a></div></td>
  </tr>
</table>
<?php } ?>
</body>
</html>